_posts/2017-02-05-are-you-one-of-us.html
---
layout: post
title: Are you one of us?
excerpt: Interviews are as much about identity as skill
---

<p>
Interviews are hard for both the interviewer and the interviewee. The interviewee's challenges are well-understood and easy to sympathize with; the interviewer's less so, but are no less serious.
</p>

<p>
Given the lengthy, complex, <i>expensive</i> process of bringing on a new employee, companies need to be careful about whom they onboard. Unfortunately, they don't have a lot of information with which to make that decision.
</p>

<p>
This bring us to the issue of interview questions. Almost all software developers are asked to solve toy problems in interviews, whether on the whiteboard or at the keyboard. Such problems have zero direct relationship with the work any company does. Inevitably, some interviewees raise the question:
</p>

<p>
&gt; Why don't interviewers ask questions directly related to the job, instead of these toy questions?
</p>

<p>
The answer is simple: it's impossible to understand how an employee will <i>actually</i> perform at a job; an interview simply does not provide enough information. Therefore, interviews are intended to answer a different question:
</p>

<p>
&gt; Are you one of us?
</p>

<p>
For a developer,
</p>

<ol class="org-ol">
<li>Did you study things like algorithms, data structures, and operating system design, etc.?
<ul class="org-ul">
<li>If you didn't, have you tried to make up for it by studying on your own?
</li>
</ul>
</li>
<li>Are you interested in new technologies?
</li>
<li>Do you program for pleasure outside of work?
</li>
<li>In short, do you do the same things I do?
</li>
</ol>

<p>
That's really all there is to it for <i>most</i> positions. So the next time you find yourself scowling at your copy of <a href="https://www.amazon.com/Cracking-Coding-Interview-Programming-Questions/dp/0984782850/ref=pd_sbs_14_t_0?_encoding=UTF8&psc=1&refRID=N5XHX5DQ1HF85Z9AWHES">Cracking the Coding Interview</a>, just remember: more than anything else, it's about proving your <b>legitimacy</b>.
</p>
